perf/StorageBeat.yml
config:
  environments:
    swarm:
      target: http://localhost:1633/bzz
      http:
        timeout: 1000
      payload:
        path: '{{ payload }}'
        fields:
         - 'existing'
        order: sequence
      variables:
        nonExisting: '22cbb9cedca08ca8d50b0319a32016174ceb8fbaa452ca5f0a77b804109baa00/'
    arweave:
      target: https://arweave.net
      http:
        timeout: 100
      variables:
        existing: '8mbU6jvUFqj07RUFOeZBLqGvyIzi7Pjpu0JLP-nHOk8'
        nonExisting: '8mbU6jvUFqj07RUFOeZBLqGvyIzi7Pjpu0JLP-nHOk7'
    ipfs:
      target: http://ipfs.localhost:8080/ipfs
      http:
        timeout: 100
      variables:
        existing: 'bafybeif64kjrj63f4v43fskfntyvz2x5qapwmcct456hjqtu56tdovcd54'
        # existing: 'bafybeigccimv3zqm5g4jt363faybagywkvqbrismoquogimy7kvz2sj7sq/1 - Barrel - Part 1.png'
        nonExisting: 'bafybeienhfkaupae32imtef6mtxi4el6noeczjlodeonbuwyfrftoidrwq'
        # nonExisting: 'bafybeigccimv3zqm5g4jt363faybagywkvqbrismoquogimy7kvz2sj7sq/test'
  phases:
    - duration: 10
      arrivalRate: 1
  plugins:
      # ensure: {}
      expect: {}
      apdex: {}
      metrics-by-endpoint:
        useOnlyRequestNames: true
scenarios:
  - name: "Existing file"
    weight: 1
    flow:
      - log: '{{ existing }}'
      - get:
          url: '/{{existing}}'
          name: "Existing file"
  - name: "Non existing file"
    weight: 1
    flow:
      - get:
          url: '/{{nonExisting}}'
          name: "Non existing file"